Data Collection And Wrangling

In [65]:
import pandas as pd 
import numpy as np

In [66]:
data = { 'Name':['ijaz','waheed','furqan','jazz','jay','jon','Huda'],
        'Age': [13,23,24,25,27,19,25],
        'Gender':['M','M','M','M','M','M','F'],
        'Marks':[90,50,59,'NaN',89,'NaN','NaN']

}

In [67]:
df =pd.DataFrame(data)
df

     Name  Age Gender Marks
0    ijaz   13      M    90
1  waheed   23      M    50
2  furqan   24      M    59
3    jazz   25      M   NaN
4     jay   27      M    89
5     jon   19      M   NaN
6    Huda   25      F   NaN

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Age     7 non-null      int64
 2   Gender  7 non-null      object
 3   Marks   7 non-null      object
dtypes: int64(1), object(3)
memory usage: 352.0+ bytes

In [9]:
df.dtypes

Name      object
Age        int64
Gender    object
Marks     object
dtype: object

In [11]:
df.sample(3)

     Name  Age Gender Marks
0    ijaz   13      M    90
1  waheed   23      M    50
4     jay   27      M    89

In [12]:
df.head()

     Name  Age Gender Marks
0    ijaz   13      M    90
1  waheed   23      M    50
2  furqan   24      M    59
3    jazz   25      M   Nan
4     jay   27      M    89

In [13]:
df.tail()

     Name  Age Gender Marks
2  furqan   24      M    59
3    jazz   25      M   Nan
4     jay   27      M    89
5     jon   19      M   Nan
6    Huda   25      F    79

In [40]:
new_df = df.replace('NaN',np.nan)
new_df

     Name  Age Gender  Marks
0    ijaz   13      M   90.0
1  waheed   23      M   50.0
2  furqan   24      M   59.0
3    jazz   25      M   72.0
4     jay   27      M   89.0
5     jon   19      M   72.0
6    Huda   25      F   72.0

In [41]:
new_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Age     7 non-null      int64
 2   Gender  7 non-null      object
 3   Marks   7 non-null      float64
dtypes: float64(1), int64(1), object(2)
memory usage: 352.0+ bytes

Dealing with Missing Values

In [49]:
# compute avarge 
c = avg = 0
for ele in df['Marks']:
    if str(ele).isnumeric():
        c += 1
        avg += ele
avg /= c

In [50]:
# replace mising values
df =df.replace(to_replace='NaN', value=avg)
df

     Name  Age Gender  Marks
0    ijaz   13      M   90.0
1  waheed   23      M   50.0
2  furqan   24      M   59.0
3    jazz   25      M   72.0
4     jay   27      M   89.0
5     jon   19      M   72.0
6    Huda   25      F   72.0

In [51]:
df.mean()

C:\Users\AFC\AppData\Local\Temp\ipykernel_14184\3698961737.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.mean()

Age      22.285714
Marks    72.000000
dtype: float64

Reshapping the Data

In [55]:
df['Gender'] = df['Gender'].map({'M':0,'F':1}).astype(float)

In [56]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Age     7 non-null      int64
 2   Gender  0 non-null      float64
 3   Marks   7 non-null      float64
dtypes: float64(2), int64(1), object(1)
memory usage: 352.0+ bytes

Filtering Data

In [79]:
# get marker which is  greater than 80
df[df['Marks'] >= 80]

TypeError: '>=' not supported between instances of 'str' and 'int'